content/man/man1/flatpak-remote-add.1.org
#+TITLE: Manpages - flatpak-remote-add.1
* NAME
flatpak-remote-add - Add a remote repository

* SYNOPSIS
*flatpak remote-add* [OPTION...] NAME LOCATION

* DESCRIPTION
Adds a remote repository to the flatpak repository configuration. NAME
is the name for the new remote, and LOCATION is a url or pathname. The
LOCATION is either a flatpak repository, or a .flatpakrepo file which
describes a repository. In the former case you may also have to specify
extra options, such as the gpg key for the repo.

Unless overridden with the *--user* or *--installation* options, this
command changes the default system-wide installation.

* OPTIONS
The following options are understood:

*-h*, *--help*

#+begin_quote
Show help options and exit.

#+end_quote

*--from*

#+begin_quote
Assume the URI is a .flatpakrepo file rather than the repository itself.
This is enabled by default if the extension is .flatpakrepo, so
generally you dont need this option.

#+end_quote

*-u*, *--user*

#+begin_quote
Modify the per-user configuration.

#+end_quote

*--system*

#+begin_quote
Modify the default system-wide configuration.

#+end_quote

*--installation=NAME*

#+begin_quote
Modify a system-wide installation specified by NAME among those defined
in /etc/flatpak/installations.d/. Using *--installation=default* is
equivalent to using *--system*.

#+end_quote

*--no-gpg-verify*

#+begin_quote
Disable GPG verification for the added remote.

#+end_quote

*--prio=PRIO*

#+begin_quote
Set the priority for the remote. Default is 1, higher is more
prioritized. This is mainly used for graphical installation tools. It is
also used when searching for a remote to provide an apps runtime. The
apps origin is checked before other remotes with the same priority.

#+end_quote

*--subset=SUBSET*

#+begin_quote
Limit the refs available from the remote to those that are part of the
named subset.

#+end_quote

*--no-enumerate*

#+begin_quote
Mark the remote as not enumerated. This means the remote will not be
used to list applications, for instance in graphical installation tools.

#+end_quote

*--no-use-for-deps*

#+begin_quote
Mark the remote as not to be used for automatic runtime dependency
resolution.

#+end_quote

*--if-not-exists*

#+begin_quote
Do nothing if the provided remote already exists.

#+end_quote

*--disable*

#+begin_quote
Disable the added remote.

#+end_quote

*--title=TITLE*

#+begin_quote
A title for the remote, e.g. for display in a UI.

#+end_quote

*--comment=COMMENT*

#+begin_quote
A single-line comment for the remote, e.g. for display in a UI.

#+end_quote

*--description=DESCRIPTION*

#+begin_quote
A full-paragraph description for the remote, e.g. for display in a UI.

#+end_quote

*--homepage=URL*

#+begin_quote
URL for a website for the remote, e.g. for display in a UI.

#+end_quote

*--icon=URL*

#+begin_quote
URL for an icon for the remote, e.g. for display in a UI.

#+end_quote

*--default-branch=BRANCH*

#+begin_quote
A default branch for the remote, mainly for use in a UI.

#+end_quote

*--filter=PATH*

#+begin_quote
Add a local filter to the remote. A filter file is a list of lines, each
file starting with "allow" or "deny", and then a glob for the ref to
allow or disallow. The globs specify a partial ref (i.e. you can leave
out trailing parts which will then match everything), but otherwise only
"*" is special, matching anything in that part of the ref.

By default all refs are allowed, but if a ref matches a deny rule it is
disallowed unless it specifically matches an allow rule. This means you
can use this to implement both allowlisting and blocklisting.

Here is an example filter file:

#+begin_quote
#+begin_example
# This is an allowlist style filter as it denies all first
deny *
allow runtime/org.freedesktop.*
allow org.some.app/arm
allow org.signal.Signal/*/stable
allow org.signal.Signal.*/*/stable
#+end_example

#+end_quote

#+end_quote

*--gpg-import=FILE*

#+begin_quote
Import gpg keys from the specified keyring file as trusted for the new
remote. If the file is - the keyring is read from standard input.

#+end_quote

*--authenticator-name=NAME*

#+begin_quote
Specify the authenticator to use for the remote.

#+end_quote

*--authenticator-option=KEY=VALUE*

#+begin_quote
Specify an authenticator option for the remote.

#+end_quote

*--authenticator-install*

#+begin_quote
Enable auto-installation of authenticator.

#+end_quote

*--no-authenticator-install*

#+begin_quote
Disable auto-installation of authenticator.

#+end_quote

*--no-follow-redirect*

#+begin_quote
Do not follow xa.redirect-url defined in the summary file.

#+end_quote

*-v*, *--verbose*

#+begin_quote
Print debug information during command processing.

#+end_quote

*--ostree-verbose*

#+begin_quote
Print OSTree debug information during command processing.

#+end_quote

* EXAMPLES
*$ flatpak remote-add gnome https://sdk.gnome.org/gnome.flatpakrepo*

*$ flatpak --user remote-add --no-gpg-verify test-repo
https://people.gnome.org/~alexl/gnome-sdk/repo/*

* SEE ALSO
*flatpak*(1), *flatpak-remote-modify*(1), *flatpak-remote-delete*(1),
*flatpak-remotes*(1), *flatpak-flatpakrepo*(5)
